TubeFinsFreeStream0Deg_90mps/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 -.25 .25)
    ( 3 -.25 .25)
    ( 3  .25 .25)
    (-1  .25 .25)
    (-1 -.25 .75)
    ( 3 -.25 .75)
    ( 3  .25 .75)
    (-1  .25 .75)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    back
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    front
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
