TubeFinsFreeStream0Deg_90mps/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 90 0 0 );

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }
    outlet
    {
        type            freestream;
        freestreamValue $internalField;
    }
    SimpleRocket
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    lowerWall
    {
        type            freestream;
        freestreamValue $internalField;
    }
    upperWall
    {
        type            freestream;
        freestreamValue $internalField;
    }
    front
    {
        type            freestream;
        freestreamValue $internalField;
    }
    back
    {
        type            freestream;
        freestreamValue $internalField;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
