TubeFinsFreeStream0Deg_90mps/0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (90 0 0);
pressure             101325;
turbulentKE          1.215;
turbulentOmega       43.4;
#inputMode           merge

// ************************************************************************* //
