TubeFinsFreeStream0Deg_90mps/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            freestream;
        freestreamValue $internalField;
    }
    back
    {
        type            freestream;
        freestreamValue $internalField;
    }
    inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }
    outlet
    {
        type            freestream;
        freestreamValue $internalField;
    }
    lowerWall
    {
        type            freestream;
        freestreamValue $internalField;
    }
    upperWall
    {
        type            freestream;
        freestreamValue $internalField;
    }
    SimpleRocket
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
